autoscaling/load-test.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://ff-webserver-loadbalancer-1986436676.eu-central-1.elb.amazonaws.com/
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 60
      arrivalRate: 10
      rampTo: 20
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    faker:
      locale: en
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
  variables:
    firstName: "$faker.name.firstName"
    lastName: "$faker.name.lastName"
    phoneNumber: "$faker.phone.number"
    eMail: "$faker.internet.email"
scenarios:
  - flow:
      # - loop:
      #   - get:
      #       url: "/rds.php"
      #   count: 10
      - log: "Making request with query: {{ firstName }} {{ lastName }}"
      - post:
          url: "/rds.php"
          formData:
           firstname: "{{ firstName }}"
           lastname: "{{ lastName }}"
           phone: "{{ phoneNumber }}"
           email: "{{ eMail }}"
           mode: "added"